multiRegion/CHT/shellAndTubeHeatExchanger/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allmesh.layers

runParallel $(getApplication)

runApplication reconstructPar -allRegions

paraFoam -touchAll

#------------------------------------------------------------------------------
